{"class_name": "Model", "keras_version": "2.2.4", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 9, 224, 224, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "TimeDistributed", "name": "time_distributed_1", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Model", "config": {"name": "xception", "input_layers": [["input_2", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_2", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "name": "block1_conv1", "filters": 32, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block1_conv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block1_conv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block1_conv1_act", "config": {"name": "block1_conv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "name": "block1_conv2", "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block1_conv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block1_conv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block1_conv2_act", "config": {"name": "block1_conv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block2_sepconv1", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 128, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block2_sepconv1", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block2_sepconv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block2_sepconv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block2_sepconv2_act", "config": {"name": "block2_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block2_sepconv2", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 128, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block2_sepconv2", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block2_sepconv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block2_sepconv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"padding": "same", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_1", "filters": 128, "kernel_size": [1, 1], "kernel_constraint": null, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "block2_pool", "pool_size": [3, 3]}, "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_1", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block3_sepconv1_act", "config": {"name": "block3_sepconv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block3_sepconv1", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 256, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block3_sepconv1", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block3_sepconv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block3_sepconv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block3_sepconv2_act", "config": {"name": "block3_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block3_sepconv2", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 256, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block3_sepconv2", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block3_sepconv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block3_sepconv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"padding": "same", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_2", "filters": 256, "kernel_size": [1, 1], "kernel_constraint": null, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "block3_pool", "pool_size": [3, 3]}, "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_2", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block4_sepconv1_act", "config": {"name": "block4_sepconv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block4_sepconv1", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block4_sepconv1", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block4_sepconv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block4_sepconv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block4_sepconv2_act", "config": {"name": "block4_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block4_sepconv2", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block4_sepconv2", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block4_sepconv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block4_sepconv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"padding": "same", "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_3", "filters": 728, "kernel_size": [1, 1], "kernel_constraint": null, "strides": [2, 2], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1]}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "block4_pool", "pool_size": [3, 3]}, "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "batch_normalization_3", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block5_sepconv1_act", "config": {"name": "block5_sepconv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block5_sepconv1", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block5_sepconv1", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block5_sepconv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block5_sepconv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block5_sepconv2_act", "config": {"name": "block5_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block5_sepconv2", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block5_sepconv2", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block5_sepconv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block5_sepconv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block5_sepconv3_act", "config": {"name": "block5_sepconv3_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block5_sepconv3", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block5_sepconv3", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block5_sepconv3_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block5_sepconv3_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block6_sepconv1_act", "config": {"name": "block6_sepconv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block6_sepconv1", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block6_sepconv1", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block6_sepconv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block6_sepconv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block6_sepconv2_act", "config": {"name": "block6_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block6_sepconv2", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block6_sepconv2", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block6_sepconv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block6_sepconv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block6_sepconv3_act", "config": {"name": "block6_sepconv3_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block6_sepconv3", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block6_sepconv3", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block6_sepconv3_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block6_sepconv3_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block7_sepconv1_act", "config": {"name": "block7_sepconv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block7_sepconv1", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block7_sepconv1", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block7_sepconv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block7_sepconv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block7_sepconv2_act", "config": {"name": "block7_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block7_sepconv2", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block7_sepconv2", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block7_sepconv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block7_sepconv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block7_sepconv3_act", "config": {"name": "block7_sepconv3_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block7_sepconv3", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block7_sepconv3", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block7_sepconv3_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block7_sepconv3_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block8_sepconv1_act", "config": {"name": "block8_sepconv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block8_sepconv1", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block8_sepconv1", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block8_sepconv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block8_sepconv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block8_sepconv2_act", "config": {"name": "block8_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block8_sepconv2", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block8_sepconv2", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block8_sepconv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block8_sepconv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block8_sepconv3_act", "config": {"name": "block8_sepconv3_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block8_sepconv3", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block8_sepconv3", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block8_sepconv3_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block8_sepconv3_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block9_sepconv1_act", "config": {"name": "block9_sepconv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block9_sepconv1", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block9_sepconv1", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block9_sepconv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block9_sepconv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block9_sepconv2_act", "config": {"name": "block9_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block9_sepconv2", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block9_sepconv2", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block9_sepconv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block9_sepconv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block9_sepconv3_act", "config": {"name": "block9_sepconv3_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block9_sepconv3", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block9_sepconv3", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block9_sepconv3_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block9_sepconv3_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block10_sepconv1_act", "config": {"name": "block10_sepconv1_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block10_sepconv1", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block10_sepconv1", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block10_sepconv1_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block10_sepconv1_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block10_sepconv2_act", "config": {"name": "block10_sepconv2_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block10_sepconv2", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "depthwise_constraint": null, "bias_regularizer": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "filters": 728, "kernel_size": [3, 3], "pointwise_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "name": "block10_sepconv2", "use_bias": false, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "depth_multiplier": 1}, "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block10_sepconv2_bn", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "axis": -1, "gamma_constraint": null, "name": "block10_sepconv2_bn", "gamma_regularizer": null, "center": true}, "inbound_nodes": [[["block10_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block10_sepconv3_act", "config": {"name": "block10_sepconv3_act", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["block10_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "block10_sepconv3", "config": {"padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 