{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_3", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 9, 224, 224, 3], "dtype": "float32", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Model", "config": {"input_layers": [["input_2", 0, 0]], "name": "xception", "output_layers": [["block14_sepconv2_act", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_2", "sparse": false, "dtype": "float32"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "strides": [2, 2], "use_bias": false, "name": "block1_conv1", "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "filters": 32}, "name": "block1_conv1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block1_conv1_bn", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block1_conv1_act", "activation": "relu"}, "name": "block1_conv1_act", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "strides": [1, 1], "use_bias": false, "name": "block1_conv2", "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "filters": 64}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block1_conv2_bn", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block1_conv2_act", "activation": "relu"}, "name": "block1_conv2_act", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block2_sepconv1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 128}, "name": "block2_sepconv1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block2_sepconv1_bn", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block2_sepconv2_act", "activation": "relu"}, "name": "block2_sepconv2_act", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block2_sepconv2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 128}, "name": "block2_sepconv2", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block2_sepconv2_bn", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "strides": [2, 2], "use_bias": false, "name": "conv2d_1", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "filters": 128}, "name": "conv2d_1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "block2_pool", "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "name": "block2_pool", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block3_sepconv1_act", "activation": "relu"}, "name": "block3_sepconv1_act", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block3_sepconv1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 256}, "name": "block3_sepconv1", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block3_sepconv1_bn", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block3_sepconv2_act", "activation": "relu"}, "name": "block3_sepconv2_act", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block3_sepconv2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 256}, "name": "block3_sepconv2", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block3_sepconv2_bn", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "strides": [2, 2], "use_bias": false, "name": "conv2d_2", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "filters": 256}, "name": "conv2d_2", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "block3_pool", "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "name": "block3_pool", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block4_sepconv1_act", "activation": "relu"}, "name": "block4_sepconv1_act", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block4_sepconv1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block4_sepconv1", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block4_sepconv1_bn", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block4_sepconv2_act", "activation": "relu"}, "name": "block4_sepconv2_act", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block4_sepconv2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block4_sepconv2", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block4_sepconv2_bn", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "strides": [2, 2], "use_bias": false, "name": "conv2d_3", "kernel_size": [1, 1], "bias_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "filters": 728}, "name": "conv2d_3", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "block4_pool", "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "name": "block4_pool", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block5_sepconv1_act", "activation": "relu"}, "name": "block5_sepconv1_act", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block5_sepconv1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block5_sepconv1", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block5_sepconv1_bn", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block5_sepconv2_act", "activation": "relu"}, "name": "block5_sepconv2_act", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block5_sepconv2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block5_sepconv2", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block5_sepconv2_bn", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block5_sepconv3_act", "activation": "relu"}, "name": "block5_sepconv3_act", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block5_sepconv3", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block5_sepconv3", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block5_sepconv3_bn", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block6_sepconv1_act", "activation": "relu"}, "name": "block6_sepconv1_act", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block6_sepconv1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block6_sepconv1", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block6_sepconv1_bn", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block6_sepconv2_act", "activation": "relu"}, "name": "block6_sepconv2_act", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block6_sepconv2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block6_sepconv2", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block6_sepconv2_bn", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block6_sepconv3_act", "activation": "relu"}, "name": "block6_sepconv3_act", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block6_sepconv3", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block6_sepconv3", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block6_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block6_sepconv3_bn", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block7_sepconv1_act", "activation": "relu"}, "name": "block7_sepconv1_act", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block7_sepconv1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block7_sepconv1", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block7_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block7_sepconv1_bn", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block7_sepconv2_act", "activation": "relu"}, "name": "block7_sepconv2_act", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block7_sepconv2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block7_sepconv2", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block7_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block7_sepconv2_bn", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block7_sepconv3_act", "activation": "relu"}, "name": "block7_sepconv3_act", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block7_sepconv3", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block7_sepconv3", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block7_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block7_sepconv3_bn", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block8_sepconv1_act", "activation": "relu"}, "name": "block8_sepconv1_act", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block8_sepconv1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block8_sepconv1", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block8_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block8_sepconv1_bn", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block8_sepconv2_act", "activation": "relu"}, "name": "block8_sepconv2_act", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block8_sepconv2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block8_sepconv2", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block8_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block8_sepconv2_bn", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block8_sepconv3_act", "activation": "relu"}, "name": "block8_sepconv3_act", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block8_sepconv3", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block8_sepconv3", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block8_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block8_sepconv3_bn", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block9_sepconv1_act", "activation": "relu"}, "name": "block9_sepconv1_act", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block9_sepconv1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block9_sepconv1", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block9_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block9_sepconv1_bn", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block9_sepconv2_act", "activation": "relu"}, "name": "block9_sepconv2_act", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block9_sepconv2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block9_sepconv2", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block9_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block9_sepconv2_bn", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block9_sepconv3_act", "activation": "relu"}, "name": "block9_sepconv3_act", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block9_sepconv3", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block9_sepconv3", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block9_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block9_sepconv3_bn", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "name": "add_8", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block10_sepconv1_act", "activation": "relu"}, "name": "block10_sepconv1_act", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block10_sepconv1", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block10_sepconv1", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block10_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block10_sepconv1_bn", "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block10_sepconv2_act", "activation": "relu"}, "name": "block10_sepconv2_act", "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", "depthwise_constraint": null, "strides": [1, 1], "use_bias": false, "name": "block10_sepconv2", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "depthwise_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 728}, "name": "block10_sepconv2", "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "block10_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "trainable": true, "center": true, "gamma_constraint": null}, "name": "block10_sepconv2_bn", "inbound_nodes": [[["block10_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block10_sepconv3_act", "activation": "relu"}, "name": "block10_sepconv3_act", "inbound_nodes": [[["block10_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depth_multiplier": 1, "pointwise_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "padding": "same", 